// Task 2. Напишите программу, которая на вход принимает два числа 
// и выдаёт, какое число большее, а какое меньшее.
/*
Console.Write("Input the first number: ");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the second number: ");
int num2 = Convert.ToInt32(Console.ReadLine());

int current = num1;

if(num1 > num2)
{
    Console.Write("Yes!");
}
else
{
    Console.Write("No!");
}
*/


// Task 4. Напишите программу, которая принимает на вход три числа 
// и выдаёт максимальное из этих чисел.
/*
Console.Write("Input the first number: ");
int a = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the second number: ");
int b = Convert.ToInt32(Console.ReadLine());
Console.Write("Input the third number: ");
int c = Convert.ToInt32(Console.ReadLine());


int max = a;

if(b > max)     max = b;

if(c > max)     max = c;

Console.WriteLine(max);
*/


// Task 6. Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
/*
Console.Write("Input an integer number: ");
int a = Convert.ToInt32(Console.ReadLine());
bool current = a % 2 == 0;

if(a % 2 == 0)
{
    Console.WriteLine("Even number");
}
else
{
    Console.WriteLine("Odd number");
}
*/

// Task 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
/*
Console.Write("Input an integer number: ");
int num = Convert.ToInt32(Console.ReadLine());

int current = 2;
int max = num;

while(current <= num)

{
    if(current % 2 ==0)
    Console.Write(current + " ");
    current++;
}
*/
    




   






























