// Task 10. Напишите программу, которая принимает на вход трёхзначное число
// и на выходе показывает вторую цифру этого числа.
/*
int ShowSecondNumber(int num)
{
    int hundreds = num % 100;
    int result = (num % 100) / 10;

    return result;
}

Console.Write("Input an integer number: ");
int num = Convert.ToInt32(Console.ReadLine());
int SecondNumber = ShowSecondNumber(num);
Console.WriteLine($"SecondNumber of {num} is {SecondNumber}");
*/